RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_pwm.c
    /* Select local force signal */
    base->SM[subModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_FORCE_SEL_MASK;
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
}

/*!
 * brief This function set the output state of the PWM pin as requested for the current cycle.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         PWM channel to configure
 * param outputstate        Set pwm output state, see @ref pwm_output_state_t.
 */
void PWM_SetChannelOutput(PWM_Type *base,
                          pwm_submodule_t subModule,
                          pwm_channels_t pwmChannel,
                          pwm_output_state_t outputstate)
{
    uint16_t mask, swcout, sourceShift;
    uint16_t reg = base->SM[subModule].CTRL2;

    if (kPWM_PwmA == pwmChannel)
    {
        mask        = PWM_MASK_MASKA(0x01UL << (uint8_t)subModule);
        swcout      = (uint16_t)PWM_SWCOUT_SM0OUT23_MASK << ((uint8_t)subModule * 2U);
        sourceShift = PWM_DTSRCSEL_SM0SEL23_SHIFT + ((uint16_t)subModule * 4U);
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        mask        = PWM_MASK_MASKB(0x01UL << (uint8_t)subModule);
        swcout      = (uint16_t)PWM_SWCOUT_SM0OUT45_MASK << ((uint8_t)subModule * 2U);
        sourceShift = PWM_DTSRCSEL_SM0SEL45_SHIFT + ((uint16_t)subModule * 4U);
    }
    else
    {
        mask        = PWM_MASK_MASKX(0x01UL << (uint8_t)subModule);
        swcout      = 0U;
        sourceShift = 0U;
    }

    if (kPWM_MaskState == outputstate)
    {
        /* Disables the channel output, forcing output level to 0 */
        base->MASK |= mask;
    }
    else
    {
        /* Enables the channel output first */
        base->MASK &= ~mask;
        /* PwmX only support MASK mode */
        if (kPWM_PwmX != pwmChannel)
        {
            if (kPWM_HighState == outputstate)
            {
                base->SWCOUT |= swcout;
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x2UL << sourceShift);
            }
            else if (kPWM_LowState == outputstate)
            {
                base->SWCOUT &= ~swcout;
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x2UL << sourceShift);
            }
            else if (kPWM_NormalState == outputstate)
            {
                base->DTSRCSEL &= ~(uint16_t)(0x3UL << sourceShift);
            }
            else
            {
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x1UL << sourceShift);
            }
        }
    }

    /* Select local force signal */
    base->SM[subModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_FORCE_SEL_MASK;
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
}
